youbaidd/esp32-tiltmaze/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO flash, single large app partition (no OTA needed here).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Octal PSRAM, matching the board's fitted memory.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 kHz tick so the physics and render tasks can pace themselves precisely.
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
